In [14]:
import pandas as pd
import numpy as np
print(pd.__version__)

1.3.5

In [15]:
df = pd.read_csv('quikr_car.csv')

In [16]:
df.shape

(892, 6)

In [17]:
df.info() #null values found in kms_driven

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 892 entries, 0 to 891
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   name        892 non-null    object
 1   company     892 non-null    object
 2   year        892 non-null    object
 3   Price       892 non-null    object
 4   kms_driven  840 non-null    object
 5   fuel_type   837 non-null    object
dtypes: object(6)
memory usage: 41.9+ KB

### data quality
- year is in object form convert to int
- year has garbage values 
- price is not in int,has commas in between 
- price has garbage value 
- kms_driven has commas,object form,nan values
- fuel type has nan values 
- keep 1st 3 words of name

### cleaning

### backup dataset

In [18]:
backup = df.copy()
backup.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 892 entries, 0 to 891
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   name        892 non-null    object
 1   company     892 non-null    object
 2   year        892 non-null    object
 3   Price       892 non-null    object
 4   kms_driven  840 non-null    object
 5   fuel_type   837 non-null    object
dtypes: object(6)
memory usage: 41.9+ KB

In [19]:
df = df[df['year'].str.isnumeric()]

In [20]:
df['year'] = df['year'].astype(int)#converted to int

In [21]:
df = df[df['Price']!='Ask For Price']

In [22]:
#remove commas
df['Price']
df['Price']=df['Price'].str.replace(',','').astype(int)

In [23]:
df['Price'] = df['Price'].astype(int)
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 819 entries, 0 to 891
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   name        819 non-null    object
 1   company     819 non-null    object
 2   year        819 non-null    int32
 3   Price       819 non-null    int32
 4   kms_driven  819 non-null    object
 5   fuel_type   816 non-null    object
dtypes: int32(2), object(4)
memory usage: 38.4+ KB

In [24]:
df = df[df['kms_driven']!='Petrol']

In [25]:
df['kms_driven'] = df['kms_driven'].str.replace(',','')
df['kms_driven'].unique()

array(['45000 kms', '40 kms', '28000 kms', '36000 kms', '41000 kms',
       '25000 kms', '24530 kms', '60000 kms', '30000 kms', '32000 kms',
       '48660 kms', '4000 kms', '16934 kms', '43000 kms', '35550 kms',
       '39522 kms', '39000 kms', '55000 kms', '72000 kms', '15975 kms',
       '70000 kms', '23452 kms', '35522 kms', '48508 kms', '15487 kms',
       '82000 kms', '20000 kms', '68000 kms', '38000 kms', '27000 kms',
       '33000 kms', '46000 kms', '16000 kms', '47000 kms', '35000 kms',
       '30874 kms', '15000 kms', '29685 kms', '130000 kms', '19000 kms',
       '54000 kms', '13000 kms', '38200 kms', '22000 kms', '50000 kms',
       '13500 kms', '3600 kms', '45863 kms', '60500 kms', '12500 kms',
       '18000 kms', '13349 kms', '29000 kms', '44000 kms', '42000 kms',
       '14000 kms', '49000 kms', '36200 kms', '51000 kms', '104000 kms',
       '33333 kms', '33600 kms', '5600 kms', '7500 kms', '26000 kms',
       '24330 kms', '65480 kms', '200000 kms', '59000 kms', '99000 kms',
       '2800 kms', '21000 kms', '11000 kms', '66000 kms', '3000 kms',
       '7000 kms', '38500 kms', '37200 kms', '43200 kms', '24800 kms',
       '45872 kms', '40000 kms', '11400 kms', '97200 kms', '52000 kms',
       '31000 kms', '175430 kms', '37000 kms', '65000 kms', '3350 kms',
       '75000 kms', '62000 kms', '73000 kms', '2200 kms', '54870 kms',
       '34580 kms', '97000 kms', '60 kms', '80200 kms', '3200 kms',
       '0000 kms', '5000 kms', '588 kms', '71200 kms', '175400 kms',
       '9300 kms', '56758 kms', '10000 kms', '56450 kms', '56000 kms',
       '32700 kms', '9000 kms', '73 kms', '160000 kms', '58559 kms',
       '57000 kms', '170000 kms', '80000 kms', '6821 kms', '23000 kms',
       '34000 kms', '1800 kms', '400000 kms', '48000 kms', '90000 kms',
       '12000 kms', '69900 kms', '166000 kms', '122 kms', '0 kms',
       '36469 kms', '7800 kms', '24695 kms', '15141 kms', '59910 kms',
       '100000 kms', '4500 kms', '129000 kms', '300 kms', '131000 kms',
       '111111 kms', '59466 kms', '25500 kms', '44005 kms', '2110 kms',
       '43222 kms', '100200 kms', '65 kms', '140000 kms', '103553 kms',
       '58000 kms', '120000 kms', '49800 kms', '100 kms', '81876 kms',
       '6020 kms', '55700 kms', '18500 kms', '53000 kms', '35500 kms',
       '22134 kms', '1000 kms', '8500 kms', '87000 kms', '6000 kms',
       '8000 kms', '55800 kms', '56400 kms', '72160 kms', '11500 kms',
       '133000 kms', '2000 kms', '88000 kms', '65422 kms', '117000 kms',
       '150000 kms', '10750 kms', '6800 kms', '9800 kms', '57923 kms',
       '30201 kms', '6200 kms', '37518 kms', '24652 kms', '383 kms',
       '95000 kms', '3528 kms', '52500 kms', '47900 kms', '52800 kms',
       '195000 kms', '48008 kms', '48247 kms', '9400 kms', '64000 kms',
       '2137 kms', '10544 kms', '147000 kms', '90001 kms', '48006 kms',
       '74000 kms', '85000 kms', '29500 kms', '39700 kms', '67000 kms',
       '19336 kms', '60105 kms', '45933 kms', '102563 kms', '28600 kms',
       '41800 kms', '116000 kms', '42590 kms', '7400 kms', '54500 kms',
       '76000 kms', '00 kms', '11523 kms', '38600 kms', '95500 kms',
       '37458 kms', '85960 kms', '12516 kms', '30600 kms', '2550 kms',
       '62500 kms', '69000 kms', '28400 kms', '68485 kms', '3500 kms',
       '85455 kms', '63000 kms', '1600 kms', '77000 kms', '26500 kms',
       '2875 kms', '13900 kms', '1500 kms', '2450 kms', '1625 kms',
       '33400 kms', '60123 kms', '137495 kms', '91200 kms', '146000 kms',
       '100800 kms', '2100 kms', '2500 kms', '132000 kms'], dtype=object)

In [26]:
df['kms_driven'] = df['kms_driven'].str.replace('kms','')

In [27]:
df['kms_driven'] = df['kms_driven'].astype(int)
df['kms_driven']

0       45000
1          40
3       28000
4       36000
6       41000
        ...
883     50000
885     30000
886    132000
888     27000
889     40000
Name: kms_driven, Length: 817, dtype: int32

In [28]:
df = df[~df['fuel_type'].isna()] #remove nan value from fuel type

In [15]:
df.head()

,name,company,year,Price,kms_driven,fuel_type
0,Hyundai Santro Xing XO eRLX Euro III,Hyundai,2007,80000,45000,Petrol
1,Mahindra Jeep CL550 MDI,Mahindra,2006,425000,40,Diesel
3,Hyundai Grand i10 Magna 1.2 Kappa VTVT,Hyundai,2014,325000,28000,Petrol
4,Ford EcoSport Titanium 1.5L TDCi,Ford,2014,575000,36000,Diesel
6,Ford Figo,Ford,2012,175000,41000,Diesel

In [29]:
df['name'] = df['name'].str.split(' ').str.slice(0,3)

In [30]:
df['name'] = df['name'].str.join(' ')
df['name']

0         Hyundai Santro Xing
1         Mahindra Jeep CL550
3           Hyundai Grand i10
4      Ford EcoSport Titanium
6                   Ford Figo
                ...
883        Maruti Suzuki Ritz
885            Tata Indica V2
886      Toyota Corolla Altis
888              Tata Zest XM
889        Mahindra Quanto C8
Name: name, Length: 816, dtype: object

In [31]:
df = df.reset_index(drop=True)

In [36]:
df

                       name   company  year   Price  kms_driven fuel_type
0       Hyundai Santro Xing   Hyundai  2007   80000       45000    Petrol
1       Mahindra Jeep CL550  Mahindra  2006  425000          40    Diesel
2         Hyundai Grand i10   Hyundai  2014  325000       28000    Petrol
3    Ford EcoSport Titanium      Ford  2014  575000       36000    Diesel
4                 Ford Figo      Ford  2012  175000       41000    Diesel
..                      ...       ...   ...     ...         ...       ...
811      Maruti Suzuki Ritz    Maruti  2011  270000       50000    Petrol
812          Tata Indica V2      Tata  2009  110000       30000    Diesel
813    Toyota Corolla Altis    Toyota  2009  300000      132000    Petrol
814            Tata Zest XM      Tata  2018  260000       27000    Diesel
815      Mahindra Quanto C8  Mahindra  2013  390000       40000    Diesel

[816 rows x 6 columns]

In [71]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 816 entries, 0 to 815
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   name        816 non-null    object
 1   company     816 non-null    object
 2   year        816 non-null    int32
 3   Price       816 non-null    int32
 4   kms_driven  816 non-null    int32
 5   fuel_type   816 non-null    object
dtypes: int32(3), object(3)
memory usage: 28.8+ KB

In [19]:
df.describe()

              year         Price     kms_driven
count   816.000000  8.160000e+02     816.000000
mean   2012.444853  4.117176e+05   46275.531863
std       4.002992  4.751844e+05   34297.428044
min    1995.000000  3.000000e+04       0.000000
25%    2010.000000  1.750000e+05   27000.000000
50%    2013.000000  2.999990e+05   41000.000000
75%    2015.000000  4.912500e+05   56818.500000
max    2019.000000  8.500003e+06  400000.000000

In [32]:
df[df['Price']>6000000]# DC ki gadi hai kya ðŸ¤£

                   name   company  year    Price  kms_driven fuel_type
534  Mahindra XUV500 W6  Mahindra  2014  8500003       45000    Diesel

In [22]:
df = df[df['Price']<6000000].reset_index(drop=True)
df

                       name   company  year   Price  kms_driven fuel_type
0       Hyundai Santro Xing   Hyundai  2007   80000       45000    Petrol
1       Mahindra Jeep CL550  Mahindra  2006  425000          40    Diesel
2         Hyundai Grand i10   Hyundai  2014  325000       28000    Petrol
3    Ford EcoSport Titanium      Ford  2014  575000       36000    Diesel
4                 Ford Figo      Ford  2012  175000       41000    Diesel
..                      ...       ...   ...     ...         ...       ...
810      Maruti Suzuki Ritz    Maruti  2011  270000       50000    Petrol
811          Tata Indica V2      Tata  2009  110000       30000    Diesel
812    Toyota Corolla Altis    Toyota  2009  300000      132000    Petrol
813            Tata Zest XM      Tata  2018  260000       27000    Diesel
814      Mahindra Quanto C8  Mahindra  2013  390000       40000    Diesel

[815 rows x 6 columns]

### storing the clean data in csv for safety

In [33]:
df.to_csv('Cleaned Car Data.csv')

### Model

In [34]:
X = df.drop(columns='Price')
y = df['Price']

In [46]:
X

                       name   company  year  kms_driven fuel_type
0       Hyundai Santro Xing   Hyundai  2007       45000    Petrol
1       Mahindra Jeep CL550  Mahindra  2006          40    Diesel
2         Hyundai Grand i10   Hyundai  2014       28000    Petrol
3    Ford EcoSport Titanium      Ford  2014       36000    Diesel
4                 Ford Figo      Ford  2012       41000    Diesel
..                      ...       ...   ...         ...       ...
810      Maruti Suzuki Ritz    Maruti  2011       50000    Petrol
811          Tata Indica V2      Tata  2009       30000    Diesel
812    Toyota Corolla Altis    Toyota  2009      132000    Petrol
813            Tata Zest XM      Tata  2018       27000    Diesel
814      Mahindra Quanto C8  Mahindra  2013       40000    Diesel

[815 rows x 5 columns]

In [47]:
y

0       80000
1      425000
2      325000
3      575000
4      175000
        ...
810    270000
811    110000
812    300000
813    260000
814    390000
Name: Price, Length: 815, dtype: int32

In [35]:
from sklearn.model_selection import train_test_split
X_train,X_test,y_train,y_test = train_test_split(X,y,test_size=0.1)

In [36]:
from sklearn.linear_model import LinearRegression
from sklearn.metrics import r2_score #to score linear regression model
from sklearn.preprocessing import OneHotEncoder #1 and 0 converter 
from sklearn.compose import make_column_transformer #columns transformer 
from sklearn.pipeline import make_pipeline

In [37]:
ohe = OneHotEncoder()
ohe.fit(X[['name','company','fuel_type']])

OneHotEncoder()

In [38]:
lr = LinearRegression()

In [39]:
column_trans = make_column_transformer((OneHotEncoder(categories=ohe.categories_),['name','company','fuel_type']),remainder='passthrough')

In [40]:
pipeline = make_pipeline(column_trans,lr)

In [41]:
pipeline.fit(X_train,y_train)

Pipeline(steps=[('columntransformer',
                 ColumnTransformer(remainder='passthrough',
                                   transformers=[('onehotencoder',
                                                  OneHotEncoder(categories=[array(['Audi A3 Cabriolet', 'Audi A4 1.8', 'Audi A4 2.0', 'Audi A6 2.0',
       'Audi A8', 'Audi Q3 2.0', 'Audi Q5 2.0', 'Audi Q7', 'BMW 3 Series',
       'BMW 5 Series', 'BMW 7 Series', 'BMW X1', 'BMW X1 sDrive20d',
       'BMW X1 xDrive20d', 'Chevrolet Beat', 'Chevrolet Beat...
                                                                            array(['Audi', 'BMW', 'Chevrolet', 'Datsun', 'Fiat', 'Force', 'Ford',
       'Hindustan', 'Honda', 'Hyundai', 'Jaguar', 'Jeep', 'Land',
       'Mahindra', 'Maruti', 'Mercedes', 'Mini', 'Mitsubishi', 'Nissan',
       'Renault', 'Skoda', 'Tata', 'Toyota', 'Volkswagen', 'Volvo'],
      dtype=object),
                                                                            array(['Diesel', 'LPG', 'Petrol'], dtype=object)]),
                                                  ['name', 'company',
                                                   'fuel_type'])])),
                ('linearregression', LinearRegression())])

In [42]:
y_pred = pipeline.predict(X_test)

In [43]:
r2_score(y_test,y_pred)

0.8729053519389128

In [44]:
# let us run train_test for 1000 times to get maximum score
scores = []#list to store scores
for i in range (0,1000):
    X_train,X_test,y_train,y_test = train_test_split(X,y,test_size=0.2,random_state=i)
    lr = LinearRegression()
    pipeline = make_pipeline(column_trans,lr)
    pipeline.fit(X_train,y_train)
    y_pred = pipeline.predict(X_test)
    scores.append(r2_score(y_test,y_pred))
    #print(r2_score(y_test,y_pred))

In [45]:
max(scores)

0.9026957107256471

In [46]:
np.argmax(scores)

661

In [47]:
X_train,X_test,y_train,y_test = train_test_split(X,y,test_size=0.2,random_state=np.argmax(scores))
lr = LinearRegression()
pipeline = make_pipeline(column_trans,lr) #shift + [ to dedent 
pipeline.fit(X_train,y_train)
y_pred = pipeline.predict(X_test)  
r2_score(y_test,y_pred)

0.9026957107256471

In [48]:
import pickle

In [50]:
pickle.dump(pipeline,open('CarPricePredictorModel.pkl','wb'))

## Prediction for one row
### name - Maruti Suzuki Swift
### company - Maruti
### year - 2019
### kms_driven - 5000
### fuel_type - Petrol

In [51]:
pipeline.predict(pd.DataFrame(columns=X_test.columns,data=np.array(['Maruti Suzuki Swift','Maruti',2019,100,'Petrol']).reshape(1,5)))

array([430236.11410041])

In [53]:
pipeline.predict(pd.DataFrame([['Maruti Suzuki Swift','Maruti',2010,500000,'Petrol']],columns=['name','company','year','kms_driven','fuel_type']))

array([89618.14194051])